k6/meet/showup/k6_output_2025-04-17_14-37-20.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: showup_v1.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 10m30s max duration (incl. graceful stop):
              * test: 4 iterations for each of 30 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 25/30 VUs, 20 complete and 0 interrupted iterations
test   [  17% ] 30 VUs  00m01.0s/10m0s  020/120 iters, 4 per VU
time="2025-04-17T14:37:22+08:00" level=info msg="CSV_LINE:batch0077@batch.com.tw,測零零七七,271900,1,20250417 14:37:20,330.42,112.54," source=console
time="2025-04-17T14:37:22+08:00" level=info msg="CSV_LINE:batch0073@batch.com.tw,測零零七三,271896,2,20250417 14:37:20,349.25,219.86," source=console
time="2025-04-17T14:37:22+08:00" level=info msg="CSV_LINE:batch0097@batch.com.tw,測零零九七,271920,3,20250417 14:37:20,341.28,226.45," source=console
time="2025-04-17T14:37:22+08:00" level=info msg="CSV_LINE:batch0069@batch.com.tw,測零零六九,271892,4,20250417 14:37:20,273.85,211.67," source=console
time="2025-04-17T14:37:22+08:00" level=info msg="CSV_LINE:batch0021@batch.com.tw,測零零二一,271844,5,20250417 14:37:20,585.69,106.34," source=console

running (00m02.0s), 25/30 VUs, 20 complete and 0 interrupted iterations
test   [  17% ] 30 VUs  00m02.0s/10m0s  020/120 iters, 4 per VU
time="2025-04-17T14:37:22+08:00" level=info msg="CSV_LINE:batch0017@batch.com.tw,測零零一七,271840,6,20250417 14:37:20,627.91,409.24," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0041@batch.com.tw,測零零四一,271864,8,20250417 14:37:20,328.99,555.57," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0013@batch.com.tw,測零零一三,271836,9,20250417 14:37:20,259.34,248.59," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0001@batch.com.tw,測零零零一,270715,10,20250417 14:37:20,348.70,922.33," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0089@batch.com.tw,測零零八九,271912,7,20250417 14:37:20,319.33,624.60," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0005@batch.com.tw,測零零零五,271828,11,20250417 14:37:20,989.68,361.62," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0053@batch.com.tw,測零零五三,271876,12,20250417 14:37:20,527.56,349.27," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0045@batch.com.tw,測零零四五,271868,13,20250417 14:37:20,667.40,857.79," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0061@batch.com.tw,測零零六一,271884,14,20250417 14:37:20,329.10,1107.42," source=console

running (00m03.0s), 25/30 VUs, 25 complete and 0 interrupted iterations
test   [  21% ] 30 VUs  00m03.0s/10m0s  025/120 iters, 4 per VU
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0093@batch.com.tw,測零零九三,271916,17,20250417 14:37:20,768.83,1187.84," source=console
time="2025-04-17T14:37:23+08:00" level=info msg="CSV_LINE:batch0065@batch.com.tw,測零零六五,271888,15,20250417 14:37:20,291.27,1342.12," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0057@batch.com.tw,測零零五七,271880,19,20250417 14:37:20,627.44,1420.77," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0029@batch.com.tw,測零零二九,271852,18,20250417 14:37:20,777.97,1267.39," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0081@batch.com.tw,測零零八一,271904,20,20250417 14:37:20,322.33,1466.80," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0085@batch.com.tw,測零零八五,271908,21,20250417 14:37:20,305.49,1493.86," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0025@batch.com.tw,測零零二五,271848,22,20250417 14:37:20,564.95,1594.89," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0033@batch.com.tw,測零零三三,271856,16,20250417 14:37:20,776.77,1558.47," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0049@batch.com.tw,測零零四九,271872,23,20250417 14:37:20,348.89,2038.31," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0037@batch.com.tw,測零零三七,271860,24,20250417 14:37:20,365.14,1720.18," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0009@batch.com.tw,測零零零九,271832,25,20250417 14:37:20,629.57,2024.25," source=console

running (00m04.0s), 25/30 VUs, 34 complete and 0 interrupted iterations
test   [  28% ] 30 VUs  00m04.0s/10m0s  034/120 iters, 4 per VU
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0078@batch.com.tw,測零零七八,271901,26,20250417 14:37:23,284.33,117.56," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0098@batch.com.tw,測零零九八,271921,27,20250417 14:37:23,262.84,155.10," source=console
time="2025-04-17T14:37:24+08:00" level=info msg="CSV_LINE:batch0074@batch.com.tw,測零零七四,271897,28,20250417 14:37:23,269.71,155.13," source=console
time="2025-04-17T14:37:25+08:00" level=info msg="CSV_LINE:batch0070@batch.com.tw,測零零七零,271893,29,20250417 14:37:23,432.22,306.91," source=console
time="2025-04-17T14:37:25+08:00" level=info msg="CSV_LINE:batch0022@batch.com.tw,測零零二二,271845,30,20250417 14:37:23,642.25,143.59," source=console
time="2025-04-17T14:37:25+08:00" level=info msg="CSV_LINE:batch0090@batch.com.tw,測零零九零,271913,31,20250417 14:37:24,348.83,121.45," source=console
time="2025-04-17T14:37:25+08:00" level=info msg="CSV_LINE:batch0018@batch.com.tw,測零零一八,271841,32,20250417 14:37:23,607.89,139.26," source=console

running (00m05.0s), 25/30 VUs, 45 complete and 0 interrupted iterations
test   [  38% ] 30 VUs  00m05.0s/10m0s  045/120 iters, 4 per VU
time="2025-04-17T14:37:25+08:00" level=info msg="CSV_LINE:batch0006@batch.com.tw,測零零零六,271829,33,20250417 14:37:24,330.70,167.21," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0054@batch.com.tw,測零零五四,271877,34,20250417 14:37:24,322.73,391.75," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0002@batch.com.tw,測零零零二,276833,35,20250417 14:37:24,507.66,389.30," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0042@batch.com.tw,測零零四二,271865,36,20250417 14:37:24,544.62,407.86," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0046@batch.com.tw,測零零四六,271869,37,20250417 14:37:24,298.00,421.48," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0094@batch.com.tw,測零零九四,271917,38,20250417 14:37:24,124.65,176.57," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0030@batch.com.tw,測零零三零,271853,40,20250417 14:37:25,194.84,197.69," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0062@batch.com.tw,測零零六二,271885,39,20250417 14:37:24,146.95,547.48," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0086@batch.com.tw,測零零八六,271909,41,20250417 14:37:25,162.21,220.72," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0066@batch.com.tw,測零零六六,271889,42,20250417 14:37:24,321.20,243.17," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0058@batch.com.tw,測零零五八,271881,43,20250417 14:37:25,194.78,493.69," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0026@batch.com.tw,測零零二六,271849,44,20250417 14:37:25,160.06,405.87," source=console

running (00m06.0s), 25/30 VUs, 52 complete and 0 interrupted iterations
test   [  43% ] 30 VUs  00m06.0s/10m0s  052/120 iters, 4 per VU
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0082@batch.com.tw,測零零八二,271905,45,20250417 14:37:25,232.56,492.37," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0038@batch.com.tw,測零零三八,271861,46,20250417 14:37:25,139.27,375.58," source=console
time="2025-04-17T14:37:26+08:00" level=info msg="CSV_LINE:batch0050@batch.com.tw,測零零五零,271873,47,20250417 14:37:25,168.26,422.74," source=console
time="2025-04-17T14:37:27+08:00" level=info msg="CSV_LINE:batch0034@batch.com.tw,測零零三四,271857,48,20250417 14:37:25,220.82,503.51," source=console
time="2025-04-17T14:37:27+08:00" level=info msg="CSV_LINE:batch0010@batch.com.tw,測零零一零,271833,49,20250417 14:37:25,111.67,303.94," source=console
time="2025-04-17T14:37:27+08:00" level=info msg="CSV_LINE:batch0099@batch.com.tw,測零零九九,271922,50,20250417 14:37:25,245.97,387.19," source=console
time="2025-04-17T14:37:27+08:00" level=info msg="CSV_LINE:batch0075@batch.com.tw,測零零七五,271898,51,20250417 14:37:25,249.81,383.92," source=console
time="2025-04-17T14:37:27+08:00" level=info msg="CSV_LINE:batch0079@batch.com.tw,測零零七九,271902,52,20250417 14:37:25,680.34,224.51," source=console

running (00m07.0s), 25/30 VUs, 64 complete and 0 interrupted iterations
test   [  53% ] 30 VUs  00m07.0s/10m0s  064/120 iters, 4 per VU
time="2025-04-17T14:37:27+08:00" level=info msg="CSV_LINE:batch0023@batch.com.tw,測零零二三,271846,53,20250417 14:37:26,360.47,114.48," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0071@batch.com.tw,測零零七一,271894,54,20250417 14:37:26,537.56,172.47," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0014@batch.com.tw,測零零一四,271837,55,20250417 14:37:24,532.60,2404.76," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0091@batch.com.tw,測零零九一,271914,56,20250417 14:37:26,385.56,182.99," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0019@batch.com.tw,測零零一九,271842,57,20250417 14:37:26,368.95,216.19," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0007@batch.com.tw,測零零零七,271830,58,20250417 14:37:26,323.06,194.89," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0095@batch.com.tw,測零零九五,271918,59,20250417 14:37:27,203.72,105.11," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0047@batch.com.tw,測零零四七,271870,60,20250417 14:37:27,214.20,151.30," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0055@batch.com.tw,測零零五五,271878,61,20250417 14:37:27,403.34,221.53," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0031@batch.com.tw,測零零三一,271854,63,20250417 14:37:27,181.71,139.07," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0003@batch.com.tw,測零零零三,271826,62,20250417 14:37:27,374.92,230.13," source=console

running (00m08.0s), 25/30 VUs, 72 complete and 0 interrupted iterations
test   [  60% ] 30 VUs  00m08.0s/10m0s  072/120 iters, 4 per VU
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0063@batch.com.tw,測零零六三,271886,64,20250417 14:37:27,171.78,315.50," source=console
time="2025-04-17T14:37:28+08:00" level=info msg="CSV_LINE:batch0087@batch.com.tw,測零零八七,271910,65,20250417 14:37:27,177.81,275.69," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0059@batch.com.tw,測零零五九,271882,66,20250417 14:37:27,113.56,213.59," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0027@batch.com.tw,測零零二七,271850,67,20250417 14:37:27,121.50,193.61," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0067@batch.com.tw,測零零六七,271890,68,20250417 14:37:27,235.02,392.01," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0083@batch.com.tw,測零零八三,271906,69,20250417 14:37:27,176.06,324.13," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0051@batch.com.tw,測零零五一,271874,70,20250417 14:37:27,192.55,277.81," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0039@batch.com.tw,測零零三九,271862,71,20250417 14:37:27,175.21,464.57," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0011@batch.com.tw,測零零一一,271834,72,20250417 14:37:28,205.05,395.60," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0035@batch.com.tw,測零零三五,271858,73,20250417 14:37:28,212.85,399.17," source=console
time="2025-04-17T14:37:29+08:00" level=info msg="CSV_LINE:batch0043@batch.com.tw,測零零四三,271866,74,20250417 14:37:27,360.81,1227.89," source=console

running (00m09.0s), 25/30 VUs, 83 complete and 0 interrupted iterations
test   [  69% ] 30 VUs  00m09.0s/10m0s  083/120 iters, 4 per VU
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0100@batch.com.tw,測零一零零,271923,75,20250417 14:37:28,334.85,205.39," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0076@batch.com.tw,測零零七六,271899,76,20250417 14:37:28,340.76,223.61," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0080@batch.com.tw,測零零八零,271903,77,20250417 14:37:28,238.82,194.85," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0024@batch.com.tw,測零零二四,271847,78,20250417 14:37:28,326.08,169.56," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0072@batch.com.tw,測零零七二,271895,79,20250417 14:37:29,313.66,168.07," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0015@batch.com.tw,測零零一五,271838,80,20250417 14:37:29,285.40,144.46," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0020@batch.com.tw,測零零二零,271843,81,20250417 14:37:29,201.93,117.95," source=console

running (00m10.0s), 25/30 VUs, 94 complete and 0 interrupted iterations
test   [  78% ] 30 VUs  00m10.0s/10m0s  094/120 iters, 4 per VU
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0092@batch.com.tw,測零零九二,271915,82,20250417 14:37:29,340.81,169.26," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0008@batch.com.tw,測零零零八,271831,83,20250417 14:37:29,314.28,176.50," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0096@batch.com.tw,測零零九六,271919,84,20250417 14:37:29,207.15,194.70," source=console
time="2025-04-17T14:37:30+08:00" level=info msg="CSV_LINE:batch0048@batch.com.tw,測零零四八,271871,85,20250417 14:37:29,152.25,218.19," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0004@batch.com.tw,測零零零四,271827,86,20250417 14:37:29,181.60,233.42," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0056@batch.com.tw,測零零五六,271879,87,20250417 14:37:29,193.30,233.52," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0064@batch.com.tw,測零零六四,271887,89,20250417 14:37:29,182.40,179.94," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0032@batch.com.tw,測零零三二,271855,88,20250417 14:37:29,218.17,384.78," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0088@batch.com.tw,測零零八八,271911,90,20250417 14:37:29,211.29,140.40," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0060@batch.com.tw,測零零六零,271883,91,20250417 14:37:30,173.00,210.46," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0028@batch.com.tw,測零零二八,271851,92,20250417 14:37:30,171.25,191.49," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0068@batch.com.tw,測零零六八,271891,93,20250417 14:37:30,249.22,153.59," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0084@batch.com.tw,測零零八四,271907,94,20250417 14:37:30,165.19,158.58," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0052@batch.com.tw,測零零五二,271875,95,20250417 14:37:30,160.96,174.73," source=console

running (00m11.0s), 19/30 VUs, 101 complete and 0 interrupted iterations
test   [  84% ] 30 VUs  00m11.0s/10m0s  101/120 iters, 4 per VU
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0040@batch.com.tw,測零零四零,271863,96,20250417 14:37:30,98.63,145.61," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0036@batch.com.tw,測零零三六,271859,97,20250417 14:37:30,194.01,125.62," source=console
time="2025-04-17T14:37:31+08:00" level=info msg="CSV_LINE:batch0012@batch.com.tw,測零零一二,271835,98,20250417 14:37:30,196.44,125.81," source=console
time="2025-04-17T14:37:32+08:00" level=info msg="CSV_LINE:batch0044@batch.com.tw,測零零四四,271867,99,20250417 14:37:30,218.07,145.45," source=console

running (00m12.0s), 05/30 VUs, 115 complete and 0 interrupted iterations
test   [  96% ] 30 VUs  00m12.0s/10m0s  115/120 iters, 4 per VU
time="2025-04-17T14:37:32+08:00" level=info msg="CSV_LINE:batch0016@batch.com.tw,測零零一六,271839,100,20250417 14:37:31,163.58,94.49," source=console

running (00m13.0s), 01/30 VUs, 119 complete and 0 interrupted iterations
test   [  99% ] 30 VUs  00m13.0s/10m0s  119/120 iters, 4 per VU

     data_received..................: 182 kB  14 kB/s
     data_sent......................: 59 kB   4.5 kB/s
     http_req_blocked...............: avg=39.91ms   min=0s      med=1µs      max=890.65ms p(90)=152.46ms  p(95)=264.22ms 
     http_req_connecting............: avg=5.38ms    min=0s      med=0s       max=44.21ms  p(90)=42.55ms   p(95)=42.93ms  
     http_req_duration..............: avg=385.7ms   min=94.49ms med=254.57ms max=2.4s     p(90)=689.18ms  p(95)=1.27s    
       { expected_response:true }...: avg=385.7ms   min=94.49ms med=254.57ms max=2.4s     p(90)=689.18ms  p(95)=1.27s    
     http_req_failed................: 0.00%   0 out of 200
     http_req_receiving.............: avg=1.56ms    min=20µs    med=86µs     max=294.4ms  p(90)=133.1µs   p(95)=149.04µs 
     http_req_sending...............: avg=301.87µs  min=26µs    med=303µs    max=595µs    p(90)=485.6µs   p(95)=534.4µs  
     http_req_tls_handshaking.......: avg=32.51ms   min=0s      med=0s       max=831.8ms  p(90)=93.81ms   p(95)=204.18ms 
     http_req_waiting...............: avg=383.83ms  min=93.85ms med=249.26ms max=2.4s     p(90)=689.02ms  p(95)=1.27s    
     http_reqs......................: 200     15.344929/s
     iteration_duration.............: avg=2.37s     min=750ns   med=2.5s     max=4.93s    p(90)=3.95s     p(95)=4.34s    
     iterations.....................: 120     9.206957/s
     query_api_response_time........: avg=321.2375  min=98.629  med=284.8665 max=989.676  p(90)=609.8436  p(95)=668.0517 
     query_api_success_rate.........: 100.00% 100 out of 100
     update_api_response_time.......: avg=450.16664 min=94.492  med=228.2905 max=2404.76  p(90)=1274.8671 p(95)=1560.2912
     update_api_success_rate........: 100.00% 100 out of 100
     vus............................: 1       min=1          max=25
     vus_max........................: 30      min=30         max=30


running (00m13.0s), 00/30 VUs, 120 complete and 0 interrupted iterations
test ✓ [ 100% ] 30 VUs  00m13.0s/10m0s  120/120 iters, 4 per VU